In [1]:
#from matplotlib import pyplot as plt
#%matplotlib inline

In [2]:
import pandas as pd

In [3]:
#df_test = pd.read_csv('sample_submission.csv')

In [4]:
%%time
products_tables = [
  'tab_2_products_2020-01-01.csv',
  'tab_2_products_2020-01-11.csv',
  'tab_2_products_2020-01-21.csv',
  'tab_2_products_2020-01-31.csv',
  'tab_2_products_2020-02-10.csv',
  'tab_2_products_2020-03-01.csv',
  'tab_2_products_2020-03-11.csv',
  'tab_2_products_2020-03-21.csv',
  'tab_2_products_2020-03-31.csv',
  'tab_2_products_2020-04-10.csv',
  'tab_2_products_2020-04-20.csv',
  'tab_2_products_2020-04-30.csv',
  'tab_2_products_2020-05-20.csv',
  'tab_2_products_2020-05-30.csv',
  'tab_2_products_2020-06-09.csv',
  'tab_2_products_2020-06-19.csv',
  'tab_2_products_2020-06-29.csv',
  'tab_2_products_2020-07-19.csv',
  'tab_2_products_2020-07-29.csv',
  'tab_2_products_2020-08-08.csv',
  'tab_2_products_2020-08-18.csv',
  'tab_2_products_2020-08-28.csv',
  'tab_2_products_2020-09-07.csv',
]

df_products = []
for i,product_table in enumerate(products_tables):
    df_products.append(pd.read_csv(product_table))

CPU times: user 1min 27s, sys: 12.4 s, total: 1min 40s
Wall time: 1min 45s

In [5]:
%%time
df_full_products = pd.concat([*df_products])

CPU times: user 4.29 s, sys: 6.33 s, total: 10.6 s
Wall time: 10.6 s

In [6]:
'''df_orders = pd.read_csv('tab_1_orders.csv')

df_categories = pd.read_csv('tab_3_categories.csv')

df_user_profiles = pd.read_csv('tab_4_user_profiles.csv')

df_product_properties = pd.read_csv('tab_5_product_properties.csv')

df_city = pd.read_csv('tab_6_city.csv')

df_sample_submission = pd.read_csv('sample_submission.csv')'''

"df_orders = pd.read_csv('tab_1_orders.csv')\n\ndf_categories = pd.read_csv('tab_3_categories.csv')\n\ndf_user_profiles = pd.read_csv('tab_4_user_profiles.csv')\n\ndf_product_properties = pd.read_csv('tab_5_product_properties.csv')\n\ndf_city = pd.read_csv('tab_6_city.csv')\n\ndf_sample_submission = pd.read_csv('sample_submission.csv')"

In [7]:
#df_full_products.info()

In [8]:
#del df_orders, df_categories, df_user_profiles, df_product_properties, df_city

In [16]:
df_full_products.shape

(51496742, 11)

In [15]:
%%time
df_full_products.isnull().sum()

user_id                     0
order_id                    0
line_item_id                0
price                       0
quantity                    0
discount                    0
product_name               25
product_id                  0
brand_name            1253849
master_category_id       9768
parent_category_id          0
dtype: int64

In [11]:
# delete all rows with df_products['product_id'] == 0
df_full_products = df_full_products[df_full_products['product_id'] != 0]

In [12]:
df_full_products.shape

(51496742, 11)

In [19]:
%%time
df_full_products['discount'] = df_full_products['discount'].apply(lambda x:max(0, x))
df_full_products['price'] = (df_full_products["price"] - df_full_products["discount"]) * df_full_products['quantity']
df_full_products.drop(['quantity', 'discount', 'line_item_id', 'product_name', 'brand_name', 'master_category_id', 'parent_category_id'], inplace=True, axis=1)
df_full_products.shape

CPU times: user 27.6 s, sys: 3.3 s, total: 30.9 s
Wall time: 30.3 s

(51496742, 4)

In [20]:
df_full_products.shape

(51496742, 4)

In [21]:
df_full_products.head()

   user_id  order_id       price  product_id
0      525   5354800  464.000000       37548
1      525   5354800   87.820004        5636
2      525   5354800   49.939995       22107
3      525   5354800  269.940010        2530
4      525   5354800  209.460011     3818486

In [22]:
df_full_products.product_id.value_counts()

709        322669
39590       95625
166         90083
55133       85217
3497419     79454
            ...
5574273         1
5585838         1
5571964         1
7996840         1
7340723         1
Name: product_id, Length: 94887, dtype: int64

In [23]:
df_full_products.head()

   user_id  order_id       price  product_id
0      525   5354800  464.000000       37548
1      525   5354800   87.820004        5636
2      525   5354800   49.939995       22107
3      525   5354800  269.940010        2530
4      525   5354800  209.460011     3818486

In [25]:
%%time
freq = df_full_products.product_id.value_counts()
df_full_products['product_in_base'] = df_full_products.product_id.apply(lambda x:freq[x])

CPU times: user 9min 47s, sys: 5.82 s, total: 9min 53s
Wall time: 9min 53s

In [27]:
df_full_products = df_full_products[df_full_products['product_in_base'] > 30]
df_full_products.shape

(51055269, 5)

In [28]:
df_full_products.drop(columns='product_in_base', axis=1)

         user_id  order_id       price  product_id
0            525   5354800  464.000000       37548
1            525   5354800   87.820004        5636
2            525   5354800   49.939995       22107
3            525   5354800  269.940010        2530
4            525   5354800  209.460011     3818486
...          ...       ...         ...         ...
3167950  3142966  16654689   17.189999       71049
3167951  3142966  16654689   -9.110001       96217
3167952  3142966  16654689  -18.610001       94125
3167953  3142966  16654689  298.489990     4235874
3167954  3142966  16654689  210.589996     3850672

[51055269 rows x 4 columns]

In [36]:
df = df_full_products[:300]
df

     user_id  order_id       price  product_id  product_in_base
0        525   5354800  464.000000       37548             4360
1        525   5354800   87.820004        5636             7566
2        525   5354800   49.939995       22107            10376
3        525   5354800  269.940010        2530             1602
4        525   5354800  209.460011     3818486              194
..       ...       ...         ...         ...              ...
298     3011   3901037   23.090000       57723             7893
299     3011   3901037   23.090000       57723             7893
300     3011   3901037   23.090000       57723             7893
301     3011   3901037   69.270000       17526             7359
302     3011   3901037   69.270000       17527             6922

[300 rows x 5 columns]

In [44]:
items = pd.DataFrame(df.groupby(['user_id', 'order_id'])['product_id'].apply(list).groupby(level=0).apply(list)).reset_index()
items.shape

(12, 2)

In [45]:
items

    user_id                                         product_id
0       525  [[37548, 5636, 22107, 2530, 3818486, 687, 6491...
1       766  [[3069043, 3041849, 216, 1990, 3883053, 13487,...
2       859  [[63872, 57391, 13345, 14535, 5483290, 99, 100...
3       932  [[5075818, 18720, 39812, 9960, 5649, 10189, 96...
4      1012                         [[58822, 2531, 38236, 10]]
5      1132  [[95825, 5073443, 54732, 3817582, 3302557, 127...
6      1646  [[96218, 4276620, 199254, 49948, 687, 4830888,...
7      1789  [[55133, 4830947, 38719, 37292, 37282, 37295, ...
8      2131  [[6005157, 37425, 37426, 38734, 4276437, 38735...
9      2171  [[199604, 5046171, 1818, 24858, 5044287], [139...
10     2268  [[37123, 17654, 9624, 5045359, 7048, 29553, 17...
11     3011  [[9602, 25843, 72796, 25847, 25848, 4275267, 6...

In [ ]:
dataset = df.groupby(['user_id']).agg({'product_id':lambda x:})

In [46]:
%%time
items = pd.DataFrame(df_full_products.groupby(['user_id', 'order_id'])['product_id'].apply(list).groupby(level=0).apply(list)).reset_index()
items.shape

CPU times: user 3min 59s, sys: 9.1 s, total: 4min 8s
Wall time: 4min 8s

(614215, 2)

In [55]:
items['num_baskets'] = items.product_id.apply(len)
items

,user_id,product_id,num_baskets
0,51,"[[5501, 19562, 50190, 45435, 3817487, 46762, 8...",15
1,65,"[[26062, 4141822, 709, 63048, 55049, 18450, 77...",19
2,83,"[[74993, 38831, 4593463, 63102, 198543, 38837,...",1
3,187,"[[88084, 88086]]",1
4,223,"[[9675, 9642, 9721, 3601876, 3601877, 9736, 19...",1
...,...,...,...
614210,3142901,"[[30337, 6999847, 7048726, 6999896]]",1
614211,3142924,"[[4033819, 84507, 80609, 105600, 12404, 667815...",1
614212,3142936,"[[37405, 3847853, 37516, 2834452, 49927, 73480...",1
614213,3142965,"[[5637, 7467109, 7339408, 65697, 2834440, 7175...",1
614214,3142966,"[[67213, 6613, 6742924, 198652, 198653, 198043...",1

In [56]:
items.to_csv("dataset.csv", index=False)

In [54]:
df['num_baskets'] = df.product_id.apply(len)
df

<ipython-input-54-5084933b8552>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['num_baskets'] = df.product_id.apply(len)

   user_id                                         product_id  num_baskets
0       51  [[5501, 19562, 50190, 45435, 3817487, 46762, 8...           15
1       65  [[26062, 4141822, 709, 63048, 55049, 18450, 77...           19
2       83  [[74993, 38831, 4593463, 63102, 198543, 38837,...            1
3      187                                   [[88084, 88086]]            1
4      223  [[9675, 9642, 9721, 3601876, 3601877, 9736, 19...            1

In [ ]:
items['len'] = items.product_id.apply(len)
items

In [ ]:
items[items['len'] > 10].count()[0]

In [ ]:
gp = items.groupby(['user_id']).order_id.count()
gp.plot().bar

In [ ]:
items['amount_orders'] = items[]